# # AULA 1

In [219]:
import pandas as pd
import numpy as np

series: São matrizes unidimensionais rotuladas capazes de armazenar dados de qualquer tipo (inteiro, string, float, objetos python, etc.) Os rotulos dos eixos são como colunas do Excel.

np.nan = uma referencia que não pode ser medida (seria um not a number)

In [6]:
series = pd.Series([7, 4, 2, np.nan,6, 9])

In [7]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

pandas.core.series.Series é uma estrutura do tipo Series

In [8]:
type(series)

pandas.core.series.Series

Gerar datas aleatorias em um tempo especifico com pandas

In [14]:
datas = pd.date_range('20180101', periods = 6, freq = 'M')

In [15]:
datas

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31', '2018-06-30'],
              dtype='datetime64[ns]', freq='M')

É o tipo de datas

In [17]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

## AULA 2

Criando um Dataframe
 
np.random.randn(6,4) - Nesse pedaço do codigo ele traz numeros aleatorios em 6 linhas e 4 colunas
index = datas - Nesse pedaço do código ele traz a indexação de linhas como "datas" (as datas que foram definidas no código acima)
columns = list("ABCD") - Nesse pedaço do código ele traz as colunas indexadas na de acordo com a lista "ABCD" que foi indicada.

In [19]:
df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = list("ABCD"))

In [20]:
df

                   A         B         C         D
2018-01-31 -1.303000  0.662968  0.058109  1.328819
2018-02-28 -0.292357  1.321690  1.226544  0.941408
2018-03-31 -0.607310  0.189782 -0.744413 -0.092839
2018-04-30 -0.193939 -0.245917  0.494979 -0.079065
2018-05-31 -0.841231  0.159592 -0.556935 -0.561080
2018-06-30 -1.431094  0.851450  0.002891 -0.152070

In [23]:
type(df)

pandas.core.frame.DataFrame

Criando um segundo DataFrame:
    
    
"A":7 -- Vai apenas repetir o numero 7 de acordo com a quantidade de linhas

'B': pd.Timestamp('20190101') -- Equivalente ao python datetime

'C': pd.Series(1, index=list(range(4)), dtype = 'float32') -- Nesse caso ele repete 1.0 em 4 linhas, já que existe um index voltado para uma lista de range(4)

"D": np.array([3] * 4, dtype='int32') -- Um Array numpy que repete o numero 3 por 4 vezes.

"E": pd.Categorical(["test", "train", "test", "train"]) -- São dados que assumem um numero finito de valores possiveis. Utilizados para otimização de memoria, mas deve se tomar cuidado ao utilizar.

'F': 'Python'

In [31]:
df2 = pd.DataFrame({"A":7,
                    'B': pd.Timestamp('20190101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    "D": np.array([3] * 4, dtype='int32'),
                    "E": pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'Python'    
                    })

In [32]:
df2

   A          B    C  D      E       F
0  7 2019-01-01  1.0  3   test  Python
1  7 2019-01-01  1.0  3  train  Python
2  7 2019-01-01  1.0  3   test  Python
3  7 2019-01-01  1.0  3  train  Python

In [47]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## AULA 3 (15)

In [48]:
datas = pd.date_range('20190101', periods = 60, freq="D")
df = pd.DataFrame(np.random.randn(60, 5), index = datas, columns = list("ABCDE"))

Fornece quantas linhas e quantas colunas existem

In [50]:
df.shape

(60, 5)

Traz a quantidade de linhas da tabela que quiser ver

In [52]:
df.head(3)

                   A         B         C         D         E
2019-01-01 -0.891873 -1.356075 -0.023964 -0.412024 -1.575114
2019-01-02  1.122717  2.032018 -0.748217  0.515678 -0.280476
2019-01-03  0.231231 -0.299635 -0.215691  1.026414 -0.948223

Incluindo e editando linhas no df

In [53]:
df['Produto'] = df['A'] * df['B']

In [58]:
df.head(3)

                   A         B         C   D         E   Produto
2019-01-01 -0.891873 -1.356075 -0.023964  88 -1.575114  1.209447
2019-01-02  1.122717  2.032018 -0.748217  88 -0.280476  2.281380
2019-01-03  0.231231 -0.299635 -0.215691  88 -0.948223 -0.069285

In [55]:
df['D'] = 88

In [59]:
df.head(3)

                   A         B         C   D         E   Produto
2019-01-01 -0.891873 -1.356075 -0.023964  88 -1.575114  1.209447
2019-01-02  1.122717  2.032018 -0.748217  88 -0.280476  2.281380
2019-01-03  0.231231 -0.299635 -0.215691  88 -0.948223 -0.069285

In [60]:
df.tail(3)

                   A         B         C   D         E   Produto
2019-02-27  1.055150  0.637017 -0.949777  88 -0.534908  0.672148
2019-02-28  0.032786  2.356683 -0.562225  88 -0.886524  0.077267
2019-03-01 -0.079010 -0.232402 -1.234729  88  0.776287  0.018362

In [61]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01',
               '2019-02-02', '2019-02-03', '2019-02-04', '2019-02-05',
               '2019-02-06', '2019-02-07', '2019-02-08', '2019-02-09',
               '2019-02-10', '2019-02-11', '2019-02-12', '2019-02-13',
               '2019-02-14', '2019-02-15', '2019-02-16', '2019-02-17',
               '2019-02-18', '2019-02-19', '2019-02-20', '2019-02-21',
               '2019-02-22', '2019-02-23', '2019-02-24', '2019-02-25',
               '2019-02-26', '2019-02-27', '2019-02-28', '2019-03-01'],
              dtype='datetime64[ns]', freq='D')

In [62]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'Produto'], dtype='object')

In [63]:
c = df.columns

In [64]:
c

Index(['A', 'B', 'C', 'D', 'E', 'Produto'], dtype='object')

Traz apenas o conteudo sem as colunas

In [69]:
df.head(5).to_numpy()

array([[-8.91873307e-01, -1.35607505e+00, -2.39642410e-02,
         8.80000000e+01, -1.57511415e+00,  1.20944714e+00],
       [ 1.12271686e+00,  2.03201756e+00, -7.48216978e-01,
         8.80000000e+01, -2.80475997e-01,  2.28138038e+00],
       [ 2.31230999e-01, -2.99634701e-01, -2.15690562e-01,
         8.80000000e+01, -9.48222966e-01, -6.92848315e-02],
       [ 6.58509877e-01,  9.17491570e-01,  2.81433611e+00,
         8.80000000e+01,  1.78524541e+00,  6.04177261e-01],
       [-5.48920288e-01, -2.96846546e-01, -6.72725391e-01,
         8.80000000e+01,  1.88701195e-01,  1.62945091e-01]])

Faz um pivot nos dados

In [70]:
df.head().T

         2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05
A         -0.891873    1.122717    0.231231    0.658510   -0.548920
B         -1.356075    2.032018   -0.299635    0.917492   -0.296847
C         -0.023964   -0.748217   -0.215691    2.814336   -0.672725
D         88.000000   88.000000   88.000000   88.000000   88.000000
E         -1.575114   -0.280476   -0.948223    1.785245    0.188701
Produto    1.209447    2.281380   -0.069285    0.604177    0.162945

## AULA 4

Combinação de DataFrame

In [73]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

In [75]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

In [76]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [80]:
frames = [df1, df2, df3]

In [89]:
type(frames)

list

O comando pd.concat() transforma uma lista em DataFrame

In [82]:
framescombinados = pd.concat(frames)

In [83]:
framescombinados

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## AULA 5

In [90]:
grupo = pd.concat([df1, df2, df3], keys=['f1','f2','f3'])

In [91]:
grupo

         A    B    C    D
f1 0    A0   B0   C0   D0
   1    A1   B1   C1   D1
   2    A2   B2   C2   D2
   3    A3   B3   C3   D3
f2 4    A4   B4   C4   D4
   5    A5   B5   C5   D5
   6    A6   B6   C6   D6
   7    A7   B7   C7   D7
f3 8    A8   B8   C8   D8
   9    A9   B9   C9   D9
   10  A10  B10  C10  D10
   11  A11  B11  C11  D11

Faz a localização de uma chave

In [92]:
grupo.loc['f2']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [93]:
#CADASTRO LOJA A

cadastro_a = {'Id': ['AA2930', 'BB4563', 'CC2139', 'DE2521', 'GT3462', 'HH1158'],
              'Nome': ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
              'Idade': [20,35,40,54,30,27],
              'CEP': ['00902-029', '11111-111', '22222-888', '00000-999', '88888-111', '77777-666']
             }
cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id', 'Nome', 'Idade', 'CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00902-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [95]:
#CADASTRO LOJA B

cadastro_b = {'Id': ['CC9999', 'EF4488', 'DD9999', 'GT3462', 'HH1158'],
              'Nome': ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
              'Idade': [19,30,22,30,27],
              'CEP': ['00902-029', '11111-111', '11111-888', '88888-111', '77777-666']
             }
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id', 'Nome', 'Idade', 'CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00902-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [96]:
#REGISTRO DE COMPRAS DE TODA UNIDADES

compras = {'Id': ['AA2930', 'EF4488', 'CC2139', 'EF4488', 'CC999', 'AA2930', 'HH1158', 'HH1158'],
           'Data': ['2019-01-01', '2019-01-30', '2019-01-30', '2019-02-01', '2019-02-20', '2019-03-15', '2019-04-01', '2019-04-10'],
           'Valor': [200,100,40,150,300,25,50,500]          
          }
compras = pd.DataFrame(compras, columns = ['Id', 'Data', 'Valor'])
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4   CC999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [ ]:
# pd.merge(tabela_da_esquerda, tabela_da_direita, on='coluna_coincidente', how='left|rigth|inner|outer')

FUNÇÃO MERGE

É a função que realiza o papel do 'join' no SQL

OBS: O x é referente a tabela da direita e o Y é referente a tabela da direita

In [97]:
#INNER JOIN

pd.merge(cadastro_a, cadastro_b, on=['Id'], how='inner')

       Id   Nome_x  Idade_x      CEP_x   Nome_y  Idade_y      CEP_y
0  GT3462  Ricardo       30  88888-111  Ricardo       30  88888-111
1  HH1158    Maria       27  77777-666    Maria       27  77777-666

In [101]:
pd.merge(cadastro_a[['Id']], cadastro_b,  on=['Id'], how='inner')

       Id     Nome  Idade        CEP
0  GT3462  Ricardo     30  88888-111
1  HH1158    Maria     27  77777-666

In [104]:
pd.merge(cadastro_a[['Id']], cadastro_b[['Id', 'Idade', 'CEP']],  on=['Id'], how='inner', suffixes =('_A', '_B'))

       Id  Idade        CEP
0  GT3462     30  88888-111
1  HH1158     27  77777-666

In [108]:
# FULL JOIN

lojas = pd.concat([cadastro_a, cadastro_b], ignore_index=True)

lojas.drop_duplicates(subset="Id")

lojas

        Id      Nome  Idade        CEP
0   AA2930    Victor     20  00902-029
1   BB4563    Amanda     35  11111-111
2   CC2139     Bruna     40  22222-888
3   DE2521    Carlos     54  00000-999
4   GT3462   Ricardo     30  88888-111
5   HH1158     Maria     27  77777-666
6   CC9999    Marcos     19  00902-029
7   EF4488  Patricia     30  11111-111
8   DD9999    Ericka     22  11111-888
9   GT3462   Ricardo     30  88888-111
10  HH1158     Maria     27  77777-666

In [110]:
# pd.merge(tabela_da_esquerda, tabela_da_direita, on='coluna_coincidente', how='left|rigth|inner|outer')

esquerda = pd.merge(cadastro_a, compras, on='Id', how='left')

GROUP BY

COMO UTILIZAR O GROUP BY com o HEAD

In [117]:
esquerda.head(4).groupby(['Id', 'Nome', 'Idade'])['Valor'].sum()

Id      Nome    Idade
AA2930  Victor  20       225.0
BB4563  Amanda  35         0.0
CC2139  Bruna   40        40.0
Name: Valor, dtype: float64

OUTER JOIN

Realiza a junção de todos os dados

In [119]:
#OUTER JOIN

pd.merge(cadastro_a, cadastro_b, on='Id', how='outer', indicator = True)

,Id,Nome_x,Idade_x,CEP_x,Nome_y,Idade_y,CEP_y,_merge
0,AA2930,Victor,20.0,00902-029,NaN,NaN,NaN,left_only
1,BB4563,Amanda,35.0,11111-111,NaN,NaN,NaN,left_only
2,CC2139,Bruna,40.0,22222-888,NaN,NaN,NaN,left_only
3,DE2521,Carlos,54.0,00000-999,NaN,NaN,NaN,left_only
4,GT3462,Ricardo,30.0,88888-111,Ricardo,30.0,88888-111,both
5,HH1158,Maria,27.0,77777-666,Maria,27.0,77777-666,both
6,CC9999,NaN,NaN,NaN,Marcos,19.0,00902-029,right_only
7,EF4488,NaN,NaN,NaN,Patricia,30.0,11111-111,right_only
8,DD9999,NaN,NaN,NaN,Ericka,22.0,11111-888,right_only

## SEÇÃO 5 Aula 26

pandas.MultiIndex

levels: valores unicos para cada estrutura de arrays [1, 2], ['blue', 'red']
codes: Indexação de localização (baseado nos levels ele vai ficar 0 ou 1) [0, 0, 1, 1], [1, 0, 1, 0]
labels: Será os nomes ['number', 'color']

In [127]:
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]

In [128]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,  'red'),
            (1, 'blue'),
            (2,  'red'),
            (2, 'blue')],
           names=['number', 'color'])

# MultIndex com produto cartesiano

iterables: 
sortorder:
names:

EX:

numbers = [0, 1, 2]
colors = ['green', 'purple']
pd.MultiIndex.from_product([numbers, colors],
                           names=['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

In [130]:
numbers = [0, 1, 2]
colors = ['green', 'purple']
pd.MultiIndex.from_product([numbers, colors],
                           names=['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## SEÇÃO 6 Aula 28

reshape

In [131]:
datas = pd.date_range('20200101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['Var_a', 'Var_b', 'Var_c', 'Var_d'])
df

               Var_a     Var_b     Var_c     Var_d
2020-01-01  0.948883 -0.345185 -0.740765  1.184703
2020-01-02 -0.563331  0.589190 -1.732969 -0.045454
2020-01-03 -0.130819  0.680232 -1.750283 -0.659255
2020-01-04  0.367999  0.078795 -0.050584 -0.806143
2020-01-05  0.844148  0.437861 -0.683662 -0.899892
2020-01-06 -1.192335 -0.202884  1.742023 -0.170887

In [134]:
dft = df.T

In [133]:
df.shape

(6, 4)

In [135]:
dft.shape

(4, 6)

Traz apenas os valores dentro do DataFrame

In [137]:
dft.values

array([[ 0.94888282, -0.56333066, -0.1308186 ,  0.36799904,  0.84414829,
        -1.19233492],
       [-0.34518512,  0.58918988,  0.68023224,  0.07879461,  0.43786078,
        -0.2028844 ],
       [-0.74076488, -1.73296852, -1.75028254, -0.05058362, -0.68366228,
         1.74202265],
       [ 1.18470295, -0.04545407, -0.65925501, -0.80614281, -0.89989196,
        -0.1708871 ]])

In [139]:
np.size(dft.values)

24

In [142]:
v = dft.values
v.reshape(1,24)

array([[ 0.94888282, -0.56333066, -0.1308186 ,  0.36799904,  0.84414829,
        -1.19233492, -0.34518512,  0.58918988,  0.68023224,  0.07879461,
         0.43786078, -0.2028844 , -0.74076488, -1.73296852, -1.75028254,
        -0.05058362, -0.68366228,  1.74202265,  1.18470295, -0.04545407,
        -0.65925501, -0.80614281, -0.89989196, -0.1708871 ]])

## AULA 29 PIVOT

In [143]:
dias = pd.date_range(start = '20190101', periods = 12, freq='D')

In [144]:
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [145]:
Pessoa = ['George', 'Victor', 'Lucas']

In [150]:
np.random.choice(Pessoa)

'Victor'

In [154]:
Nome = []
Gasto = []
for i in range(12):
    Nome.append(np.random.choice(Pessoa))
    Gasto.append(np.round(np.random.rand()*100,2))
Nome

['George',
 'George',
 'George',
 'George',
 'Victor',
 'Victor',
 'Lucas',
 'George',
 'George',
 'George',
 'Victor',
 'George']

In [155]:
Gasto

[98.37,
 84.99,
 68.34,
 94.34,
 50.0,
 14.66,
 55.97,
 77.8,
 81.75,
 98.23,
 77.45,
 56.08]

In [156]:
df = pd.DataFrame({'Dia': dias, 'Nome':Nome, 'Gasto':Gasto})
df

          Dia    Nome  Gasto
0  2019-01-01  George  98.37
1  2019-01-02  George  84.99
2  2019-01-03  George  68.34
3  2019-01-04  George  94.34
4  2019-01-05  Victor  50.00
5  2019-01-06  Victor  14.66
6  2019-01-07   Lucas  55.97
7  2019-01-08  George  77.80
8  2019-01-09  George  81.75
9  2019-01-10  George  98.23
10 2019-01-11  Victor  77.45
11 2019-01-12  George  56.08

In [168]:
ndf = df.pivot(index = 'Dia', columns = 'Nome', values='Gasto')

Incluir 0 nas tabelas no lugar de NaN

In [169]:
ndf.fillna(value = 0, inplace = True)
ndf

Nome        George  Lucas  Victor
Dia
2019-01-01   98.37   0.00    0.00
2019-01-02   84.99   0.00    0.00
2019-01-03   68.34   0.00    0.00
2019-01-04   94.34   0.00    0.00
2019-01-05    0.00   0.00   50.00
2019-01-06    0.00   0.00   14.66
2019-01-07    0.00  55.97    0.00
2019-01-08   77.80   0.00    0.00
2019-01-09   81.75   0.00    0.00
2019-01-10   98.23   0.00    0.00
2019-01-11    0.00   0.00   77.45
2019-01-12   56.08   0.00    0.00

## AULA 30 pivot_table

Permite indices repetidos

EX:
df.pivot_table(index = 'Data', columns = 'Vendedor' ,values = 'Vendas', aggfunc = 'sum') 

OBS: Se eu não incluir o aggfunc = 'sum', ele vai trazer a media

In [170]:
Carros = [7, 4, 3, 2, 8]
dias = pd.date_range('20190101','20190101', periods=5)
vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

df = pd.DataFrame({'Vendas':Carros, 'Data':dias, 'Vendedor':vendedor})
df

   Vendas       Data Vendedor
0       7 2019-01-01   George
1       4 2019-01-01   Vagner
2       3 2019-01-01    Pedro
3       2 2019-01-01   Vagner
4       8 2019-01-01   George

In [172]:
df.pivot(index = 'Data', columns = 'Vendedor' ,values = 'Vendas')

In [174]:
df.pivot_table(index = 'Data', columns = 'Vendedor' ,values = 'Vendas', aggfunc = 'sum')

Vendedor    George  Pedro  Vagner
Data
2019-01-01      15      3       6

## AULA 31 STACK

Realzia um empilhamento, tranformando tudo o que é coluna em linha com um indice

Ler arquivos CSV de uma URL

In [176]:
df = pd.read_csv("URL") # LER ARQUIVO CSV DE UMA URL

In [ ]:
stack_df = df.stack() #Realiza o empilhamento

stack_df

In [ ]:
stack_df.unstack() #Desfaz o empilhamento

## AULA 32 MELT

In [178]:
df = pd.DataFrame({
    'A': {0: 'a', 1: 'b', 2: 'c'},
    'B': {0: 1, 1: 3, 2: 5},
    'C': {0: 2, 1: 4, 2: 6}
})

In [179]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [181]:
pd.melt(df, id_vars = ['A'], value_vars = ['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [183]:
pd.melt(df, id_vars = ['A'], value_vars = ['B', 'C'], var_name = 'VarTeste', value_name = 'Nome do Valor')

   A VarTeste  Nome do Valor
0  a        B              1
1  b        B              3
2  c        B              5
3  a        C              2
4  b        C              4
5  c        C              6

In [184]:
data = {
    "localizacao" : ['CidadeA', 'CidadeB'],
    "Temperatura" : ["Prevista", "Atual"],
    "Set-2019" : [30, 32],
    "Out-2019" : [45, 43],
    "Nov-2019": [24, 22]    
}
data

{'localizacao': ['CidadeA', 'CidadeB'],
 'Temperatura': ['Prevista', 'Atual'],
 'Set-2019': [30, 32],
 'Out-2019': [45, 43],
 'Nov-2019': [24, 22]}

In [185]:
df = pd.DataFrame(data, columns=['localizacao', 'Temperatura', 'Set-2019', 'Out-2019', 'Nov-2019'])
df

  localizacao Temperatura  Set-2019  Out-2019  Nov-2019
0     CidadeA    Prevista        30        45        24
1     CidadeB       Atual        32        43        22

In [188]:
df2 = pd.melt(df, id_vars = ["localizacao", "Temperatura"], var_name = "Date", value_name = "Value")
df2

  localizacao Temperatura      Date  Value
0     CidadeA    Prevista  Set-2019     30
1     CidadeB       Atual  Set-2019     32
2     CidadeA    Prevista  Out-2019     45
3     CidadeB       Atual  Out-2019     43
4     CidadeA    Prevista  Nov-2019     24
5     CidadeB       Atual  Nov-2019     22

## SEÇÃO 7 Aula 34

In [222]:
datas = pd.date_range('20180101', periods = 600, freq='D')
df = pd.DataFrame(np.random.randn(600,5), index = datas, columns = list("ABCDE"))
df

                   A         B         C         D         E
2018-01-01  0.439248  0.505600  0.081734 -0.751816 -1.165681
2018-01-02  1.069747 -0.992968  0.021234 -0.869652  0.586167
2018-01-03 -0.821165  1.303339  0.601107 -1.332470 -0.822258
2018-01-04  0.696791  1.019702 -0.731369 -0.594154  1.104628
2018-01-05 -0.730790  0.234054 -0.822891  0.969615  0.473935
...              ...       ...       ...       ...       ...
2019-08-19 -0.336122 -0.393704  0.155395 -0.303416  1.780600
2019-08-20 -0.026581  0.415454  0.554342  1.133910 -0.307983
2019-08-21  0.705089 -0.893657 -0.870239 -0.315339  0.061555
2019-08-22  0.176750 -0.339537 -1.501080  0.503602 -0.806285
2019-08-23 -2.363251  1.688725 -0.938893  0.304400 -0.440904

[600 rows x 5 columns]

In [196]:
df["D"].head(5)

2018-01-01   -0.709665
2018-01-02    0.164562
2018-01-03    0.618709
2018-01-04    1.990610
2018-01-05    0.198422
Freq: D, Name: D, dtype: float64

In [197]:
df[1:5]

                   A         B         C         D         E
2018-01-02 -0.683814  0.226235  1.241611  0.164562 -2.665523
2018-01-03  0.349556  1.214016 -2.149052  0.618709 -0.456710
2018-01-04  0.358209 -1.963806  1.527083  1.990610 -0.491661
2018-01-05 -0.433546 -0.732143  0.158586  0.198422 -2.384051

In [198]:
df.loc[:, ['B', 'C', 'D']]

                   B         C         D
2018-01-01  0.408819  0.042267 -0.709665
2018-01-02  0.226235  1.241611  0.164562
2018-01-03  1.214016 -2.149052  0.618709
2018-01-04 -1.963806  1.527083  1.990610
2018-01-05 -0.732143  0.158586  0.198422
...              ...       ...       ...
2019-08-19  0.304277  0.133286 -0.492677
2019-08-20  1.122031 -0.795634 -0.809870
2019-08-21  0.657991 -1.002763  0.802236
2019-08-22 -0.499976  0.327432  0.931371
2019-08-23 -0.911520  0.164179  0.254080

[600 rows x 3 columns]

In [205]:
f = df.loc['20180301':'20180917', ['A','E']]

In [206]:
len(f)

201

## AULA 35

In [208]:
#df.iloc[linhas, colunas]

df.iloc[2:4, 0:2]

                   A         B
2018-01-03  0.349556  1.214016
2018-01-04  0.358209 -1.963806

In [209]:
df.iloc[[1,5,6], [0,3]]

                   A         D
2018-01-02 -0.683814  0.164562
2018-01-06 -0.152521 -0.535566
2018-01-07 -1.011820  0.278986

In [210]:
df.iloc[1:3, :]

                   A         B         C         D         E
2018-01-02 -0.683814  0.226235  1.241611  0.164562 -2.665523
2018-01-03  0.349556  1.214016 -2.149052  0.618709 -0.456710

## AULA 36

In [211]:
df[df.A > 0]

                   A         B         C         D         E
2018-01-01  0.227179  0.408819  0.042267 -0.709665 -0.801796
2018-01-03  0.349556  1.214016 -2.149052  0.618709 -0.456710
2018-01-04  0.358209 -1.963806  1.527083  1.990610 -0.491661
2018-01-08  1.998905  0.370259 -1.379539 -0.296745  0.831924
2018-01-09  0.156279 -0.435856  0.137982 -0.551077 -0.001934
...              ...       ...       ...       ...       ...
2019-08-14  0.081290 -0.955945  1.052913 -1.067465  0.071752
2019-08-15  0.985453 -1.894324 -0.523527 -0.156564  0.794581
2019-08-18  0.431713 -0.525774  0.950104  0.212657 -0.143264
2019-08-19  2.281457  0.304277  0.133286 -0.492677  2.069774
2019-08-23  1.686365 -0.911520  0.164179  0.254080  0.298952

[299 rows x 5 columns]

In [215]:
na = df[df > 0]
na.fillna(value = 0, inplace = True)
na

                   A         B         C         D         E
2018-01-01  0.227179  0.408819  0.042267  0.000000  0.000000
2018-01-02  0.000000  0.226235  1.241611  0.164562  0.000000
2018-01-03  0.349556  1.214016  0.000000  0.618709  0.000000
2018-01-04  0.358209  0.000000  1.527083  1.990610  0.000000
2018-01-05  0.000000  0.000000  0.158586  0.198422  0.000000
...              ...       ...       ...       ...       ...
2019-08-19  2.281457  0.304277  0.133286  0.000000  2.069774
2019-08-20  0.000000  1.122031  0.000000  0.000000  0.000000
2019-08-21  0.000000  0.657991  0.000000  0.802236  0.000000
2019-08-22  0.000000  0.000000  0.327432  0.931371  0.000000
2019-08-23  1.686365  0.000000  0.164179  0.254080  0.298952

[600 rows x 5 columns]

## SEÇÃO 8 Aula 37

Limpeza de dados

In [226]:
datas = pd.date_range('20200101', periods=6)

df = pd.DataFrame(np.random.randn(6, 4), index=datas, columns=['Var_A', 'Var_B', 'Var_C', 'Var_D'])

In [228]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
    'D': np.array([3] * 4, dtype = 'int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'Python'
})

In [229]:
df

               Var_A     Var_B     Var_C     Var_D
2020-01-01  0.052316  0.911101 -1.168494  1.161942
2020-01-02 -0.481122  0.764527 -0.846366  1.001869
2020-01-03  1.270009 -1.061872  0.068213 -0.491184
2020-01-04 -1.695997  0.107295  0.158173 -0.543921
2020-01-05 -0.460699  0.749590  1.637140  0.192780
2020-01-06 -0.229948 -0.101793  0.113193  1.184461

In [231]:
df.shape

(6, 4)

In [232]:
df.dtypes

Var_A    float64
Var_B    float64
Var_C    float64
Var_D    float64
dtype: object

In [235]:
df2

     A          B    C  D      E       F
0  1.0 2013-01-02  1.0  3   test  Python
1  1.0 2013-01-02  1.0  3  train  Python
2  1.0 2013-01-02  1.0  3   test  Python
3  1.0 2013-01-02  1.0  3  train  Python

In [234]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [237]:
df2.describe() #Funciona somente para dados numericos

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

FUNÇÃO reindex

In [238]:
df1 = df.reindex(index=datas[0:4], columns=list(df.columns) + ['Var_E'])
df1

               Var_A     Var_B     Var_C     Var_D  Var_E
2020-01-01  0.052316  0.911101 -1.168494  1.161942    NaN
2020-01-02 -0.481122  0.764527 -0.846366  1.001869    NaN
2020-01-03  1.270009 -1.061872  0.068213 -0.491184    NaN
2020-01-04 -1.695997  0.107295  0.158173 -0.543921    NaN

In [240]:
df1.loc[datas[0]:datas[1], 'Var_E'] = 1
df1

               Var_A     Var_B     Var_C     Var_D  Var_E
2020-01-01  0.052316  0.911101 -1.168494  1.161942    1.0
2020-01-02 -0.481122  0.764527 -0.846366  1.001869    1.0
2020-01-03  1.270009 -1.061872  0.068213 -0.491184    NaN
2020-01-04 -1.695997  0.107295  0.158173 -0.543921    NaN

In [241]:
df1.dtypes

Var_A    float64
Var_B    float64
Var_C    float64
Var_D    float64
Var_E    float64
dtype: object

In [242]:
df1.describe()

          Var_A     Var_B     Var_C     Var_D  Var_E
count  4.000000  4.000000  4.000000  4.000000    2.0
mean  -0.213699  0.180263 -0.447119  0.282177    1.0
std    1.230295  0.898835  0.661243  0.926007    0.0
min   -1.695997 -1.061872 -1.168494 -0.543921    1.0
25%   -0.784841 -0.184996 -0.926898 -0.504368    1.0
50%   -0.214403  0.435911 -0.389077  0.255343    1.0
75%    0.356739  0.801171  0.090703  1.041888    1.0
max    1.270009  0.911101  0.158173  1.161942    1.0

## AULA 39

In [243]:
datas = pd.date_range('20190101', periods = 60, freq="D")
df = pd.DataFrame(np.random.randn(60,5), index = datas, columns = list("ABCDE"))

In [244]:
df.head(3)

                   A         B         C         D         E
2019-01-01  0.087845 -0.690958 -0.583260 -1.216612 -0.653145
2019-01-02  0.045532  0.778867 -0.452122 -0.497005 -0.549504
2019-01-03 -0.252121 -1.272135 -0.692451  0.353402 -0.053321

In [245]:
df['F'] = df.A[ df.A > 0]

In [246]:
df.head(3)

                   A         B         C         D         E         F
2019-01-01  0.087845 -0.690958 -0.583260 -1.216612 -0.653145  0.087845
2019-01-02  0.045532  0.778867 -0.452122 -0.497005 -0.549504  0.045532
2019-01-03 -0.252121 -1.272135 -0.692451  0.353402 -0.053321       NaN

In [261]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
E    float64
F    float64
dtype: object

In [247]:
df2 = df.copy()

In [248]:
df3 = df.copy()

In [250]:
df2.dropna().shape

(29, 6)

Preencher NaN com algum outro valor

fillna

In [254]:
df3.F.fillna(np.mean(df3.A))

2019-01-01    0.087845
2019-01-02    0.045532
2019-01-03   -0.164417
2019-01-04    0.033098
2019-01-05   -0.164417
2019-01-06   -0.164417
2019-01-07    0.256709
2019-01-08   -0.164417
2019-01-09    0.011294
2019-01-10    0.575208
2019-01-11   -0.164417
2019-01-12   -0.164417
2019-01-13    1.553487
2019-01-14   -0.164417
2019-01-15    1.094734
2019-01-16    0.433816
2019-01-17   -0.164417
2019-01-18    0.579785
2019-01-19   -0.164417
2019-01-20   -0.164417
2019-01-21   -0.164417
2019-01-22   -0.164417
2019-01-23    0.357868
2019-01-24   -0.164417
2019-01-25    1.476272
2019-01-26   -0.164417
2019-01-27    1.045565
2019-01-28   -0.164417
2019-01-29    0.114331
2019-01-30   -0.164417
2019-01-31   -0.164417
2019-02-01    1.296842
2019-02-02   -0.164417
2019-02-03   -0.164417
2019-02-04   -0.164417
2019-02-05    0.098437
2019-02-06    0.585785
2019-02-07    0.349406
2019-02-08    0.151512
2019-02-09    0.203701
2019-02-10   -0.164417
2019-02-11   -0.164417
2019-02-12    0.382991
2019-02-13   -0.164417
2019-02-14   -0.164417
2019-02-15    0.819731
2019-02-16    0.424465
2019-02-17   -0.164417
2019-02-18   -0.164417
2019-02-19   -0.164417
2019-02-20    0.044981
2019-02-21    0.456707
2019-02-22   -0.164417
2019-02-23   -0.164417
2019-02-24    0.665012
2019-02-25   -0.164417
2019-02-26   -0.164417
2019-02-27    0.130737
2019-02-28    0.105430
2019-03-01    0.722080
Freq: D, Name: F, dtype: float64

In [256]:
df4 = df.copy()

In [259]:
dft = df4.fillna(value = 'NULL')

In [260]:
dft.dtypes

A    float64
B    float64
C    float64
D    float64
E    float64
F     object
dtype: object

## AULA EXTRA SEPARAR POR COLUNAS

In [277]:
data = ['São Paulo/SP', 'Brasilia/DF', 'Goiania/GO', 'Rio de Janeiro/RJ', 'Rio Branco/AC', 'Manaus/AM', 'Maceio/AL',
'Belem/PA', 'Curitiba/PR']

df2 = pd.DataFrame(data, index= list(range(50, 59)), columns= ['Local']) 
df2

                Local
50       São Paulo/SP
51        Brasilia/DF
52         Goiania/GO
53  Rio de Janeiro/RJ
54      Rio Branco/AC
55          Manaus/AM
56          Maceio/AL
57           Belem/PA
58        Curitiba/PR

In [283]:
df2[['Cidade', 'Estado']] = df2['Local'].str.split('/', expand = True)
df2

                Local          Cidade Estado
50       São Paulo/SP       São Paulo     SP
51        Brasilia/DF        Brasilia     DF
52         Goiania/GO         Goiania     GO
53  Rio de Janeiro/RJ  Rio de Janeiro     RJ
54      Rio Branco/AC      Rio Branco     AC
55          Manaus/AM          Manaus     AM
56          Maceio/AL          Maceio     AL
57           Belem/PA           Belem     PA
58        Curitiba/PR        Curitiba     PR

In [285]:
datas = ['São Paulo/SP/Brasil', 'Brasilia/DF/Brasil', 'Goiania/GO/Brasil', 'Rio de Janeiro/RJ/Brasil', 'Rio Branco/AC/Brasil', 'Manaus/AM/Brasil', 'Maceio/AL/Brasil',
'Belem/PA/Brasil', 'Curitiba/PR/Brasil']

df3 = pd.DataFrame(datas, columns=['Local'])
df3

                      Local
0       São Paulo/SP/Brasil
1        Brasilia/DF/Brasil
2         Goiania/GO/Brasil
3  Rio de Janeiro/RJ/Brasil
4      Rio Branco/AC/Brasil
5          Manaus/AM/Brasil
6          Maceio/AL/Brasil
7           Belem/PA/Brasil
8        Curitiba/PR/Brasil

In [287]:
df3[['Cidade', 'Estado']] = df3['Local'].str.split('/', expand = True, n=1)
df3

                      Local          Cidade     Estado
0       São Paulo/SP/Brasil       São Paulo  SP/Brasil
1        Brasilia/DF/Brasil        Brasilia  DF/Brasil
2         Goiania/GO/Brasil         Goiania  GO/Brasil
3  Rio de Janeiro/RJ/Brasil  Rio de Janeiro  RJ/Brasil
4      Rio Branco/AC/Brasil      Rio Branco  AC/Brasil
5          Manaus/AM/Brasil          Manaus  AM/Brasil
6          Maceio/AL/Brasil          Maceio  AL/Brasil
7           Belem/PA/Brasil           Belem  PA/Brasil
8        Curitiba/PR/Brasil        Curitiba  PR/Brasil

In [288]:
df3[['Cidade', 'Estado']] = df3['Local'].str.rsplit('/', expand = True, n=1)
df3

                      Local             Cidade  Estado
0       São Paulo/SP/Brasil       São Paulo/SP  Brasil
1        Brasilia/DF/Brasil        Brasilia/DF  Brasil
2         Goiania/GO/Brasil         Goiania/GO  Brasil
3  Rio de Janeiro/RJ/Brasil  Rio de Janeiro/RJ  Brasil
4      Rio Branco/AC/Brasil      Rio Branco/AC  Brasil
5          Manaus/AM/Brasil          Manaus/AM  Brasil
6          Maceio/AL/Brasil          Maceio/AL  Brasil
7           Belem/PA/Brasil           Belem/PA  Brasil
8        Curitiba/PR/Brasil        Curitiba/PR  Brasil

## AULA 40

In [ ]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
    'D': np.array([3] * 4, dtype = 'int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'Python',
    'G': [2,2,4,4],
    'H': [np.nan,2,4,np.nan]
})